In [85]:
# 먼저 판다스 라이브러리 불러옵시다.
import pandas as pd

In [87]:
# read_csv는 파일 경로를 지정하고, 해당 파일을 불러오는 역할을 합니다.
pd.read_csv(filepath_or_buffer='pokemon.csv').head()

      Pokemon            Type
0   Bulbasaur  Grass / Poison
1     Ivysaur  Grass / Poison
2    Venusaur  Grass / Poison
3  Charmander            Fire
4  Charmeleon            Fire

In [89]:
# 인덱스를 직접 지정할 수 있다고 전 챕터에서 말했죠?
pd.read_csv(filepath_or_buffer='pokemon.csv',
            index_col='Pokemon').head()

                      Type
Pokemon
Bulbasaur   Grass / Poison
Ivysaur     Grass / Poison
Venusaur    Grass / Poison
Charmander            Fire
Charmeleon            Fire

In [90]:
# 변수를 할당하지 않으면 저장되지 않습니다.
pokemon = pd.read_csv(filepath_or_buffer='pokemon.csv',
                      index_col='Pokemon')

In [91]:
# 주식 데이터도 불러와보죠
pd.read_csv('google_stocks.csv').head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [93]:
# parse_dates는 해당 열을 데이터형으로 지정하는거죠.
pd.read_csv(filepath_or_buffer='google_stocks.csv',
            parse_dates=['Date']).head()

        Date  Close
0 2004-08-19  49.98
1 2004-08-20  53.95
2 2004-08-23  54.50
3 2004-08-24  52.24
4 2004-08-25  52.80

In [7]:
google = pd.read_csv(filepath_or_buffer='google_stocks.csv',
                     index_col='Date',
                     parse_dates=['Date'])
google.head()

            Close
Date
2004-08-19  49.98
2004-08-20  53.95
2004-08-23  54.50
2004-08-24  52.24
2004-08-25  52.80

In [95]:
# 독립 전쟁 데이터도 불러와볼까요?
pd.read_csv('revolutionary_war.csv').head()

                              Battle  Start Date          State
0                       Powder Alarm    9/1/1774  Massachusetts
1  Storming of Fort William and Mary  12/14/1774  New Hampshire
2   Battles of Lexington and Concord   4/19/1775  Massachusetts
3                    Siege of Boston   4/19/1775  Massachusetts
4                 Gunpowder Incident   4/20/1775       Virginia

In [96]:
pd.read_csv(filepath_or_buffer='revolutionary_war.csv',
            index_col='Start Date',
            parse_dates=['Start Date']).head()

                                       Battle          State
Start Date
1774-09-01                       Powder Alarm  Massachusetts
1774-12-14  Storming of Fort William and Mary  New Hampshire
1775-04-19   Battles of Lexington and Concord  Massachusetts
1775-04-19                    Siege of Boston  Massachusetts
1775-04-20                 Gunpowder Incident       Virginia

In [10]:
battles = pd.read_csv(filepath_or_buffer='revolutionary_war.csv',
                      index_col='Start Date',
                      parse_dates=['Start Date'],
                      usecols=['State', 'Start Date'])
battles.head()

                    State
Start Date
1774-09-01  Massachusetts
1774-12-14  New Hampshire
1775-04-19  Massachusetts
1775-04-19  Massachusetts
1775-04-20       Virginia

In [98]:
# sort_values는 by에 입력한 열을 기준으로 정렬을 시도하고, ascending은 오름차순/내림차순을 결정합니다.
google.sort_values(by='Close', ascending=True).head()

            Close
Date
2004-09-03  49.82
2004-09-01  49.94
2004-08-19  49.98
2004-09-02  50.57
2004-09-07  50.60

In [100]:
# 문자열의 경우, 알파벳 순서대로 정렬을 실시합니다.
pokemon.sort_values('Type').head()

         Type
Pokemon
Illumise  Bug
Silcoon   Bug
Pinsir    Bug
Burmy     Bug
Wurmple   Bug

In [14]:
# 판다스는 대문자를 먼저 배열시키고, 소문자는 나중에 배열시킨다.
pd.Series(data=['Adam', 'adam', 'Ben']).sort_values()

0    Adam
2     Ben
1    adam
dtype: object

In [101]:
# 결측치를 가장 나중에 배치한다.
battles.sort_values(by='State',
                    na_position='last').head()

                  State
Start Date
1781-09-06  Connecticut
1779-07-05  Connecticut
1777-04-27  Connecticut
1777-09-03     Delaware
1777-05-17      Florida

In [103]:
# 결측값을 가장 상단에 위치시킨다.
battles.sort_values(by='State',
                    na_position='first').head()

           State
Start Date
1775-09-17   NaN
1775-12-31   NaN
1776-03-03   NaN
1776-03-25   NaN
1776-05-18   NaN

In [104]:
# axis 0일때는 행방향 > 가로, axis 1일때는 열방향 > 세로
battles.dropna(axis=0).sort_values(by='State').head()

                  State
Start Date
1781-09-06  Connecticut
1779-07-05  Connecticut
1777-04-27  Connecticut
1777-09-03     Delaware
1777-05-17      Florida

In [105]:
# 인덱스 순서대로 배열할 수 있습니다.
battles.sort_index().head()

                    State
Start Date
1774-09-01  Massachusetts
1774-12-14  New Hampshire
1775-04-19  Massachusetts
1775-04-19  Massachusetts
1775-04-20       Virginia

In [106]:
# 높은 값을 가지는 행을 5개 추려낼 수 있는 방법이 2가지가 있는데, 
# 그 중에 하나는 head를 이용하는 것이고
google.sort_values(by='Close', ascending=False).head()

              Close
Date
2019-04-29  1287.58
2019-04-26  1272.18
2018-07-26  1268.33
2019-10-25  1265.13
2019-04-23  1264.55

In [108]:
# 나머지 하나는 nlargest를 이용하는 것입니다.
google.nlargest(5, columns=['Close'])

              Close
Date
2019-04-29  1287.58
2019-04-26  1272.18
2018-07-26  1268.33
2019-10-25  1265.13
2019-04-23  1264.55

In [109]:
# 하위 데이터도 마찬가지겠죠?
google.nsmallest(5, columns=['Close'])

            Close
Date
2004-09-03  49.82
2004-09-01  49.94
2004-08-19  49.98
2004-09-02  50.57
2004-09-07  50.60

In [110]:
battles.sort_values(by='State', inplace=True)
battles.head()

                  State
Start Date
1781-09-06  Connecticut
1779-07-05  Connecticut
1777-04-27  Connecticut
1777-09-03     Delaware
1777-05-17      Florida

In [111]:
# 특정 값들의 분포는 value_counts로도 확인할 수 있고,
pokemon.value_counts()

Type
Normal             65
Water              61
Grass              38
Psychic            35
Fire               30
                   ..
Fire / Rock         1
Rock / Fighting     1
Normal / Dragon     1
Fire / Ghost        1
Water / Steel       1
Name: count, Length: 159, dtype: int64

In [112]:
import numpy as np
# unique를 이용해서도 확인할 수 있습니다.
sorted(np.unique(pokemon['Type'], return_counts=True)[1], reverse=True)

[np.int64(65),
 np.int64(61),
 np.int64(38),
 np.int64(35),
 np.int64(30),
 np.int64(28),
 np.int64(26),
 np.int64(22),
 np.int64(18),
 np.int64(16),
 np.int64(16),
 np.int64(15),
 np.int64(14),
 np.int64(13),
 np.int64(12),
 np.int64(12),
 np.int64(11),
 np.int64(11),
 np.int64(9),
 np.int64(9),
 np.int64(9),
 np.int64(7),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(6),
 np.int64(5),
 np.int64(5),
 np.int64(5),
 np.int64(5),
 np.int64(5),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(4),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(3),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(2),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1),
 np.int64(1)]

In [113]:
# unique 함수는 중복되지 않은 값들을 가져오고,
pokemon['Type'].unique()

array(['Grass / Poison', 'Fire', 'Fire / Flying', 'Water', 'Bug',
       'Bug / Flying', 'Bug / Poison', 'Normal / Flying', 'Normal',
       'Poison', 'Electric', 'Ground', 'Poison / Ground', 'Fairy',
       'Normal / Fairy', 'Poison / Flying', 'Bug / Grass', 'Fighting',
       'Water / Fighting', 'Psychic', 'Water / Poison', 'Rock / Ground',
       'Water / Psychic', 'Electric / Steel', 'Water / Ice',
       'Ghost / Poison', 'Grass / Psychic', 'Ground / Rock', 'Grass',
       'Psychic / Fairy', 'Ice / Psychic', 'Water / Flying',
       'Rock / Water', 'Rock / Flying', 'Ice / Flying',
       'Electric / Flying', 'Dragon', 'Dragon / Flying',
       'Water / Electric', 'Fairy / Flying', 'Psychic / Flying',
       'Water / Fairy', 'Rock', 'Grass / Flying', 'Water / Ground',
       'Dark', 'Dark / Flying', 'Ghost', 'Normal / Psychic',
       'Bug / Steel', 'Ground / Flying', 'Steel / Ground', 'Bug / Rock',
       'Bug / Fighting', 'Dark / Ice', 'Fire / Rock', 'Ice / Ground',
       'Water / Rock', 'Steel / Flying', 'Dark / Fire', 'Water / Dragon',
       'Rock / Dark', 'Psychic / Grass', 'Fire / Fighting',
       'Water / Grass', 'Grass / Dark', 'Bug / Water', 'Grass / Fighting',
       'Bug / Ground', 'Bug / Ghost', 'Dark / Ghost', 'Steel / Fairy',
       'Steel / Rock', 'Fighting / Psychic', 'Water / Dark',
       'Fire / Ground', 'Ground / Dragon', 'Rock / Psychic',
       'Ground / Psychic', 'Rock / Grass', 'Rock / Bug', 'Ice',
       'Ice / Water', 'Steel / Psychic', 'Steel', 'Dragon / Psychic',
       'Grass / Ground', 'Water / Steel', 'Normal / Water',
       'Rock / Steel', 'Ghost / Flying', 'Poison / Dark', 'Ghost / Dark',
       'Dragon / Ground', 'Fighting / Steel', 'Poison / Bug',
       'Poison / Fighting', 'Grass / Ice', 'Psychic / Fighting',
       'Ice / Ghost', 'Electric / Ghost', 'Steel / Dragon',
       'Fire / Steel', 'Ghost / Dragon', 'Psychic / Fire',
       'Ground / Steel', 'Grass / Fairy', 'Ground / Dark',
       'Dark / Fighting', 'Normal / Grass', 'Water / Ghost',
       'Bug / Electric', 'Grass / Steel', 'Ghost / Fire',
       'Ground / Electric', 'Ground / Ghost', 'Dark / Steel',
       'Dark / Dragon', 'Bug / Fire', 'Steel / Fighting',
       'Rock / Fighting', 'Flying', 'Dragon / Fire', 'Dragon / Electric',
       'Dragon / Ice', 'Fire / Psychic', 'Normal / Ground',
       'Fire / Normal', 'Fighting / Dark', 'Steel / Ghost',
       'Dark / Psychic', 'Poison / Water', 'Poison / Dragon',
       'Electric / Normal', 'Rock / Dragon', 'Rock / Ice',
       'Fighting / Flying', 'Electric / Fairy', 'Rock / Fairy',
       'Ghost / Grass', 'Flying / Dragon', 'Psychic / Ghost',
       'Fire / Water', 'Grass / Ghost', 'Fire / Dark', 'Fighting / Ice',
       'Bug / Fairy', 'Water / Bug', 'Poison / Fire', 'Normal / Fighting',
       'Ghost / Ground', 'Fire / Dragon', 'Ghost / Fairy',
       'Normal / Dragon', 'Dragon / Fighting', 'Psychic / Steel',
       'Rock / Poison', 'Fighting / Ghost', 'Fire / Ghost'], dtype=object)

In [114]:
# nunique는 중복되지 않은 값들의 개수를 가져옵니다.
pokemon['Type'].nunique()

159

In [115]:
# normalize는 정규화를 시켜서, 해당 데이터가 전체에 대해 얼마나 분포해있는지를 확인합니다.
pokemon.value_counts(normalize=True).head()*100

Type
Normal     8.034611
Water      7.540173
Grass      4.697157
Psychic    4.326329
Fire       3.708282
Name: proportion, dtype: float64

In [116]:
# Normal 타입은 전체의 8.03%을 차지하는군요.
(pokemon.value_counts(normalize=True).head()*100).round(2)

Type
Normal     8.03
Water      7.54
Grass      4.70
Psychic    4.33
Fire       3.71
Name: proportion, dtype: float64

In [117]:
# 주식의 최소값을 보고,
google.min()

Close    49.82
dtype: float64

In [118]:
# 최대값을 봐서
google.max()

Close    1287.58
dtype: float64

In [120]:
# 주식 데이터에 구간을 나누어봅시다. 간격은 200으로 지정하겠습니다.
# 원래는 value_counts 함수에서 bins를 지정할 수 있지만, 최근 pandas에서는 삭제되었습니다.
# 그래서 cut함수를 사용하시면 됩니다.
buckets = [0, 200, 400, 600, 800, 1000, 1200, 1400]
bucketed = pd.cut(google['Close'], bins=buckets)
bucketed.value_counts()

Close
(200, 400]      1568
(0, 200]         595
(400, 600]       575
(1000, 1200]     406
(600, 800]       380
(800, 1000]      207
(1200, 1400]      93
Name: count, dtype: int64

In [121]:
# 맞는거 갖죠?
len(google[google['Close'] > 1200])

93

In [122]:
# 기본적인 value_counts는 결측치를 제거한 상태로 반환하기 때문에
battles.value_counts().head()

State
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Massachusetts     11
Name: count, dtype: int64

In [123]:
# 결측치가 있는 데이터의 개수를 보고싶다면 dropna를 False로 지정하시면 됩니다.
battles.value_counts(dropna=False).head()

State
NaN               70
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Name: count, dtype: int64

In [125]:
# 판다스는 브로드캐스팅 방식으로 google*1000의 경우 모든 데이터에 1000을 곱하는데,
# 함수도 마찬가지 입니다.
google.round(1).head()

            Close
Date
2004-08-19   50.0
2004-08-20   54.0
2004-08-23   54.5
2004-08-24   52.2
2004-08-25   52.8

In [127]:
# apply 함수를 사용해도 같은 결과를 얻습니다.
google.apply(func=round).head()

            Close
Date
2004-08-19   50.0
2004-08-20   54.0
2004-08-23   54.0
2004-08-24   52.0
2004-08-25   53.0

In [128]:
# / 기호를 포함하고 있으면 멀티타입으로, 그렇지 않으면 싱글 타입으로 분류하는 함수가 있습니다.
def single_or_multi(pokemon_type):
    if "/" in pokemon_type:
        return "Multi"
    return "Single"

In [129]:
# 새로운 열을 생성해서, 해당 함수를 적용시키면 되겠죠?
pokemon['single/multi'] = pokemon['Type'].apply(single_or_multi)
pokemon.head()

                      Type single/multi
Pokemon
Bulbasaur   Grass / Poison        Multi
Ivysaur     Grass / Poison        Multi
Venusaur    Grass / Poison        Multi
Charmander            Fire       Single
Charmeleon            Fire       Single

In [130]:
# 이렇게 unique함수를 사용해서 multi와 single이 몇개씩 분포해있는지를 확인할 수 있습니다.
np.unique(pokemon['single/multi'], return_counts=True)

(array(['Multi', 'Single'], dtype=object), array([405, 404]))